src/DataProcessors/ОбновлениеСостоянийЗаявокДляСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеСостоянийЗаявокДляСайта</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьРубли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РазмещенияСтрокЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РазмещенияСтрокЗаказов</Name>
			<Comment>Размещения строк заказов в поступлениях</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗаявкиПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/ОбновлениеСостоянийЗаявокДляСайта/Ext/ManagerModule.bsl
// Обновление состояний строк заявок для отображения на сайте
//
// Параметры:
//  вхСтрокаЗаявки  - <СправочникСсылка.ИдентификаторыСтрокЗаявок> - Если задано, будет обновлено состояние только указанной строки заявки
//
Процедура ОбновитьСостоянияСтрокЗаявок(вхСтрокаЗаявки = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.СтрокаЗаявки КАК СтрокаЗаявки,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество,
	|	МАКСИМУМ(ПродажиОбороты.Регистратор) КАК Реализация,
	|	МАКСИМУМ(ПродажиОбороты.Период) КАК ДатаОтгрузки
	|ПОМЕСТИТЬ втПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), Регистратор, ) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.СтрокаЗаявки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыТоваровОстатки.СтрокаЗаявки КАК СтрокаЗаявки,
	|	РезервыТоваровОстатки.КоличествоОстаток КАК Количество,
	|	РезервыТоваровОстатки.ЕдиницаИзмерения.Владелец.Артикул КАК Артикул,
	|	РезервыТоваровОстатки.Склад.Код КАК КодСкладаРезерва
	|ПОМЕСТИТЬ втРезервы
	|ИЗ
	|	РегистрНакопления.РезервыТоваров.Остатки(КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), ) КАК РезервыТоваровОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОтгрузкеОбороты.СтрокаЗаявки КАК СтрокаЗаявки,
	|	ТоварыКОтгрузкеОбороты.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ втСборки
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Обороты(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), , ) КАК ТоварыКОтгрузкеОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещенияСтрокЗаявокОстатки.СтрокаЗаявки КАК СтрокаЗаявки,
	|	СУММА(РазмещенияСтрокЗаявокОстатки.КоличествоОстаток) КАК Количество,
	|	МАКСИМУМ(РазмещенияСтрокЗаявокОстатки.СтрокаЗаказа.ЗаказПоставщику.Номер) КАК ЗаказНомер,
	|	МАКСИМУМ(РазмещенияСтрокЗаявокОстатки.СтрокаЗаказа.ЗаказПоставщику.Дата) КАК ЗаказДата
	|ПОМЕСТИТЬ втРазмещения
	|ИЗ
	|	РегистрНакопления.РазмещенияСтрокЗаявок.Остатки(КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), ) КАК РазмещенияСтрокЗаявокОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещенияСтрокЗаявокОстатки.СтрокаЗаявки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещенияСтрокЗаявокОстатки.СтрокаЗаявки КАК СтрокаЗаявки,
	|	ТоварыПеремещенияОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ втПеремещения
	|ИЗ
	|	РегистрНакопления.ТоварыПеремещения.Остатки(КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), ) КАК ТоварыПеремещенияОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещенияСтрокЗаказов.Остатки(&ТекущаяДата, ) КАК РазмещенияСтрокЗаказовОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещенияСтрокЗаявок.Остатки(&ТекущаяДата, ) КАК РазмещенияСтрокЗаявокОстатки
	|			ПО РазмещенияСтрокЗаказовОстатки.СтрокаЗаказа = РазмещенияСтрокЗаявокОстатки.СтрокаЗаказа
	|		ПО ТоварыПеремещенияОстатки.СтрокаПрихода = РазмещенияСтрокЗаказовОстатки.СтрокаПрихода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиПокупателейОстатки.СтрокаЗаявки КАК СтрокаЗаявки,
	|	ЗаявкиПокупателейОстатки.КоличествоОстаток КАК Количество,
	|	ЗаявкиПокупателейОстатки.ЕдиницаИзмерения.Владелец.Артикул КАК АртикулДоЗамены,
	|	ЗаявкиПокупателейОстатки.ЕдиницаИзмерения.Владелец.Изготовитель КАК Изготовитель
	|ПОМЕСТИТЬ втЗаявки
	|ИЗ
	|	РегистрНакопления.ЗаявкиПокупателей.Остатки(КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ), ) КАК ЗаявкиПокупателейОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втЗаявки.СтрокаЗаявки, втПродажи.СтрокаЗаявки) КАК СтрокаЗаявки,
	|	ЕСТЬNULL(втЗаявки.Количество, 0) КАК КоличествоЗаявка,
	|	ЕСТЬNULL(втПродажи.Количество, 0) КАК КоличествоПродажа,
	|	втЗаявки.АртикулДоЗамены,
	|	втЗаявки.Изготовитель,
	|	втПродажи.Реализация,
	|	втПродажи.ДатаОтгрузки
	|ПОМЕСТИТЬ втЗаявкиПродажи
	|ИЗ
	|	втПродажи КАК втПродажи
	|		ПОЛНОЕ СОЕДИНЕНИЕ втЗаявки КАК втЗаявки
	|		ПО втПродажи.СтрокаЗаявки = втЗаявки.СтрокаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаявкиПродажи.СтрокаЗаявки,
	|	втЗаявкиПродажи.КоличествоЗаявка КАК КолвоЗаявка,
	|	втЗаявкиПродажи.КоличествоПродажа КАК КолвоОтгружено,
	|	ЕСТЬNULL(втПеремещения.Количество, 0) КАК КоличествоПеремещение,
	|	ЕСТЬNULL(втРазмещения.Количество, 0) КАК КолвоЗаказано,
	|	ЕСТЬNULL(втРезервы.Количество, 0) КАК КолвоРезерв,
	|	ЕСТЬNULL(втСборки.Количество, 0) КАК КоличествоСборка,
	|	втЗаявкиПродажи.СтрокаЗаявки.Заявка КАК Заявка,
	|	втЗаявкиПродажи.СтрокаЗаявки.IDSite КАК IDSite,
	|	втЗаявкиПродажи.СтрокаЗаявки.Заявка.Номер КАК ЗаявкаНомер,
	|	втЗаявкиПродажи.СтрокаЗаявки.Заявка.Дата КАК ЗаявкаДата,
	|	втЗаявкиПродажи.АртикулДоЗамены,
	|	втЗаявкиПродажи.Изготовитель,
	|	втРазмещения.ЗаказНомер,
	|	втРазмещения.ЗаказДата,
	|	ЕСТЬNULL(втРезервы.Артикул, втЗаявкиПродажи.АртикулДоЗамены) КАК Артикул,
	|	втРезервы.КодСкладаРезерва,
	|	втЗаявкиПродажи.Реализация,
	|	втЗаявкиПродажи.ДатаОтгрузки
	|ИЗ
	|	втЗаявкиПродажи КАК втЗаявкиПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРезервы КАК втРезервы
	|		ПО втЗаявкиПродажи.СтрокаЗаявки = втРезервы.СтрокаЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСборки КАК втСборки
	|		ПО втЗаявкиПродажи.СтрокаЗаявки = втСборки.СтрокаЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРазмещения КАК втРазмещения
	|		ПО втЗаявкиПродажи.СтрокаЗаявки = втРазмещения.СтрокаЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПеремещения КАК втПеремещения
	|		ПО втЗаявкиПродажи.СтрокаЗаявки = втПеремещения.СтрокаЗаявки";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		
		СтрокаЗаявки = Выборка.СтрокаЗаявки;
		
		Состояние = Неопределено;
		Если ТипЗнч(СтрокаЗаявки.ПрайсПоставщика.Владелец) = Тип("СправочникСсылка.Склады") Тогда
			
			Состояние = ПолучитьСостояниеСток(Выборка);
			
		Иначе
			
			Состояние = ПолучитьСостоянияКросс(Выборка);
			
		КонецЕсли;
		
		ЗаписьРегистра = РегистрыСведений.ТаблицаСостояний.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.Состояние = Состояние;
		ЗаписьРегистра.КолвоОтказ = Выборка.КолвоЗаявка - Выборка.КолвоРезерв;
		ЗаписьРегистра.ОсновноеСостояние = Число(Состояние.Код);
		_ЗаполнитьЗначения(ЗаписьРегистра, СтрокаЗаявки);
		ЗаписьРегистра.Записать();
		
	КонецЦикла;

КонецПроцедуры // ОбновитьСостоянияСтрокЗаявок()

Процедура _ЗаполнитьЗначения(вхЗаписьРегистра, вхСтрокаЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаЗаявки", вхСтрокаЗаявки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаПокупателяТовары.Номенклатура.Представление КАК Наименование,
	               |	ЗаявкаПокупателяТовары.Цена,
	               |	ЗаявкаПокупателяТовары.Количество КАК НачКолвоЗаявка,
	               |	ЗаявкаПокупателяТовары.СрокГарантированный КАК СрокПоставки
	               |ИЗ
	               |	Документ.ЗаявкаПокупателя.Товары КАК ЗаявкаПокупателяТовары
	               |ГДЕ
	               |	ЗаявкаПокупателяТовары.СтрокаЗаявки = &СтрокаЗаявки";
	_ПоследняяКорректировка = Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(вхСтрокаЗаявки.Заявка);
	
	Если ТипЗнч(_ПоследняяКорректировка) = Тип("ДокументСсылка.КорректировкаЗаявкиПокупателя") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ЗаявкаПокупателя.Товары", "Документ.КорректировкаЗаявкиПокупателя.Товары");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(вхЗаписьРегистра, Выборка);
	
КонецПроцедуры

Функция ПолучитьСостояниеСток(Выборка)
	
	Если Выборка.КолвоОтгружено = 0 Тогда
		//нет отгрузок
		Если Выборка.КоличествоСборка = 0 Тогда
			//нет сборки
			Если Выборка.КолвоРезерв = 0 Тогда
				//нет резерва
				Если Выборка.КоличествоПеремещение Тогда
					//есть перемещения
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.Перемещяется
				Иначе
					//нет перемещений
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.Отказ
				КонецЕсли;
			Иначе
				//есть резерв
				Если Выборка.КолвоРезерв = Выборка.КолвоЗаказано Тогда
					//совпадает с заявкой
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВРезервеНаСкладе
				Иначе
					//не совпадает с заявкой
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.НаСкладеНеВсеКоличество
				КонецЕсли;
			КонецЕсли;
		Иначе
			//идет сборка
			Возврат Справочники.СостоянияСтрокЗаявокДляСайта.Сборка;
		КонецЕсли;
	Иначе
		//есть отгрузки
		Если Выборка.КолвоРезерв > 0 Тогда
			//остались резервы
			Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВыданоНеВсеКоличество
		Иначе
			//нет резервов
			//Если ЗначениеЗаполнено(Выборка.Реализация.МаршрутДоставки) Тогда
				Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВыданоСамовывоз
			//Иначе
			//	Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВыданоСамовывоз
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСостоянияКросс(Выборка)
	
	Если Выборка.КолвоОтгружено = 0 Тогда
		//нет отгрузок
		Если Выборка.КоличествоСборка = 0 Тогда
			//нет сборок
			Если Выборка.КолвоРезерв = 0 Тогда
				//нет резервов
				Если Выборка.КолвоЗаказано = 0 Тогда
					//нет размещений
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.Новый
				Иначе
					//есть размещения
					Если Выборка.КолвоЗаказано = Выборка.КолвоЗаказано Тогда
						//совпадает с заявкой
						Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ЗаказаноУПоставщика
					Иначе
						//не совпадает с заявкой
						Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ЗаказаноУПоставщикаНеВсеКоличество
					КонецЕсли;
				КонецЕсли;
			Иначе
				//есть резервы
				Если Выборка.КолвоРезерв = Выборка.КолвоЗаказано Тогда
					//совпадает с заявкой
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВРезервеНаСкладе
				Иначе
					//не совпадает с заявкой
					Возврат Справочники.СостоянияСтрокЗаявокДляСайта.НаСкладеНеВсеКоличество
				КонецЕсли;
			КонецЕсли;
		Иначе
			//есть сборка
			Возврат Справочники.СостоянияСтрокЗаявокДляСайта.Сборка
		КонецЕсли;
	Иначе
		//есть отгрузки
		Если Выборка.КолвоРезерв > 0 Тогда
			//остались резервы
			Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВыданоНеВсеКоличество
		Иначе
			//нет резервов
			//Если ЗначениеЗаполнено(Выборка.Реализация.МаршрутДоставки) Тогда
				Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВыданоСамовывоз
			//Иначе
			//	Возврат Справочники.СостоянияСтрокЗаявокДляСайта.ВыданоСамовывоз
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
